ТаблицаТоваров = Новый ТаблицаЗначений;

Колонки = ТаблицаТоваров.Колонки;
Колонки.Добавить("Товар");
Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Творог";
СтрокаТаблицы.Цена = 50;
СтрокаТаблицы.Количество = 3;

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Молоко";
СтрокаТаблицы.Цена = 65;
СтрокаТаблицы.Количество = 2;

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Кефир";
СтрокаТаблицы.Цена = 45;
СтрокаТаблицы.Количество = 4;

ИтоговаяСумма = 0;

Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
	ТекущийТовар = СтрокаТовара.Товар;
	ТекущаяСумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
	СтрокаВывода = СтрШаблон("%1 - Сумма = %2", ТекущийТовар, ТекущаяСумма);
	ИтоговаяСумма = ИтоговаяСумма + ТекущаяСумма;
	Сообщить(СтрокаВывода);
КонецЦикла;

Сообщить("Итого к оплате = " + ИтоговаяСумма);