//-----Задание 1
СебестоимостьТовара = 100;
ПроцентНаценки = 0.4;
СтавкаНДС = 0.2;

ЦенаСНаценкой = СебестоимостьТовара * ПроцентНаценки + СебестоимостьТовара;
message("ЦенаСНаценкой: " + ЦенаСНаценкой);
НДСотЦЕНЫ = ЦенаСНаценкой * СтавкаНДС;
message("НДСотЦЕНЫ: " + НДСотЦЕНЫ);
ИтоговаяЦена = ЦенаСНаценкой + НДСотЦЕНЫ;

message("ИтоговаяЦена: " + ИтоговаяЦена);

//-----Задание 2

Товар = "Яблоки";
Количество = 30;
Склад = "Основной";

СтрокаВывода1 = "На дату " + ТекущаяДата() + " остаток по товару " + НРег(Товар) +
	" - " + Количество + " шт. на складе " + НРег(Склад);
СтрокаВывода2 = СтрШаблон("На дату %1 остаток по товару %2 - %3 шт. на складе %4",
		ТекущаяДата(), НРег(Товар), Количество, НРег(Склад));

message(СтрокаВывода1);
message(СтрокаВывода2);

//----- Задание 3

ВремяНачалаПриема = '2026.03.05 113000';
ВремяОкончанияПриема = '2026.03.05 123000';
ДлительностьПриема = ВремяОкончанияПриема - ВремяНачалаПриема;
Hours = Цел(ДлительностьПриема / 3600);
Minutes = ДлительностьПриема % 3600;
message(СтрШаблон("Длительность приема %1 ч. %2 м.", Hours, Minutes));
// Или как в видео
ВремяНачалаПриема = '2026.03.05 113000';
ВремяОкончанияПриема = '2026.03.05 123000';
ДлительностьПриема = ВремяОкончанияПриема - ВремяНачалаПриема;
ДлительностьПриема = '0001-01-01 00:00:00' + ДлительностьПриема;
message(СтрШаблон("Длительность приема %1 ч. %2 м.", Hour(ДлительностьПриема), Minute(ДлительностьПриема)));