СебестоимостьТовара = 100;
ПроцентНаценки = 0.4;
СтавкаНДС = 0.2;

ЦенаСНаценкой = СебестоимостьТовара * ПроцентНаценки + СебестоимостьТовара;
message("ЦенаСНаценкой: " + ЦенаСНаценкой);
НДСотЦЕНЫ = ЦенаСНаценкой * СтавкаНДС;
message("НДСотЦЕНЫ: " + НДСотЦЕНЫ);
ИтоговаяЦена = ЦенаСНаценкой + НДСотЦЕНЫ;

message("ИтоговаяЦена: " + ИтоговаяЦена);

//-----

Товар = "Яблоки";
Количество = 30;
Склад = "Основной";

СтрокаВывода1 = "На дату " + ТекущаяДата() + " остаток по товару " + НРег(Товар) +
	" - " + Количество + " шт. на складе " + НРег(Склад);
СтрокаВывода2 = СтрШаблон("На дату %1 остаток по товару %2 - %3 шт. на складе %4",
		ТекущаяДата(), НРег(Товар), Количество, НРег(Склад));

message(СтрокаВывода1);
message(СтрокаВывода2);

//-----