//--------------------------Создание Номенклатуры-----------------------------------
&НаСервере
Процедура ЗавестиНоменклатуруНаСервере()
	Справочники.Товары.СоздатьТовар(НазваниеТовара, Производитель, Цена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавестиНоменклатуру(Команда)
	ЗавестиНоменклатуруНаСервере();
КонецПроцедуры
//--------------------------Поиск Номенклатуры и заполнение------------------------

&НаСервере
Процедура НайтиНоменклатуруНаСервере()
	НайденнаяНоменклатура = Справочники.Товары.НайтиНоменклатуру(НазваниеТовара);
	Если НайденнаяНоменклатура <> Неопределено Тогда
		Цена = НайденнаяНоменклатура.Цена;
		Производитель = НайденнаяНоменклатура.Производитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	НайтиНоменклатуруНаСервере();
КонецПроцедуры

//--------------------------------------------------------
Процедура СоздатьТовар(Название, Производитель, Цена) Экспорт
	НовыйТовар = СоздатьЭлемент();
	НовыйТовар.Наименование = Название;
	НовыйТовар.Производитель = Производитель;
	НовыйТовар.Цена = Цена;
	НовыйТовар.Записать();
КонецПроцедуры

Функция НайтиНоменклатуру(Название) Экспорт
	ЭлементПоиска = Справочники.Товары.НайтиПоНаименованию(Название);
	
	Если ЭлементПоиска.Пустая() Тогда
		Сообщить("Товар не найден: " + Название);
		Возврат Неопределено; // или кинуть исключение
	КонецЕсли;
	
	ОбъектПоиска = ЭлементПоиска.ПолучитьОбъект();
	Возврат ОбъектПоиска;
	//Сообщить("Товар найден - " + (НЕ ЭлементПоиска.Пустая()));
	
КонецФункции