ТаблицаТоваров = Новый ТаблицаЗначений;

Колонки = ТаблицаТоваров.Колонки;
Колонки.Добавить("Товар");
Колонки.Добавить("Цена");
Колонки.Добавить("Количество");

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Творог";
СтрокаТаблицы.Цена = 50;
СтрокаТаблицы.Количество = 3;

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Молоко";
СтрокаТаблицы.Цена = 65;
СтрокаТаблицы.Количество = 2;

СтрокаТаблицы = ТаблицаТоваров.Добавить();
СтрокаТаблицы.Товар = "Кефир";
СтрокаТаблицы.Цена = 45;
СтрокаТаблицы.Количество = 4;