Процедура СоздатьТовар(Название, Производитель, Цена) Экспорт
	НовыйТовар = СоздатьЭлемент();
	НовыйТовар.Наименование = Название;
	НовыйТовар.Производитель = Производитель;
	НовыйТовар.Цена = Цена;
	НовыйТовар.Записать();
КонецПроцедуры

Функция НайтиНоменклатуру(Название) Экспорт
	ЭлементПоиска = Справочники.Товары.НайтиПоНаименованию(Название);
	
	Если ЭлементПоиска.Пустая() Тогда
		Сообщить("Товар не найден: " + Название);
		Возврат Неопределено; // или кинуть исключение
	КонецЕсли;
	
	ОбъектПоиска = ЭлементПоиска.ПолучитьОбъект();
	Возврат ОбъектПоиска;
	//Сообщить("Товар найден - " + (НЕ ЭлементПоиска.Пустая()));
	
КонецФункции