// Функция - Загрузить данные в таблицу
//
// Параметры:
//  СтруктураКолонок	 - 	 -
//  СтрокаВнешнихДанных	 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция ЗагрузитьДанныеВТаблицу(СтруктураКолонок, СтрокаВнешнихДанных) Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Колонки = ТаблицаДанных.Колонки;
	
	Для Каждого ОписаниеКолонки Из СтруктураКолонок Цикл
		Если ТипЗнч(ОписаниеКолонки.Значение) = Тип("ОписаниеТипов") Тогда
			Колонки.Добавить(ОписаниеКолонки.Ключ, ОписаниеКолонки.Значение);
		Иначе
			Колонки.Добавить(ОписаниеКолонки.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	МассивСтрок = СтрРазделить(СтрокаВнешнихДанных, Символы.ПС);
	
	Для Каждого СтрокаДанных Из МассивСтрок Цикл
		Если ПустаяСтрока(СтрокаДанных) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДанных = СтрРазделить(СтрокаДанных, ",", Ложь);
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		
		Для Индекс = 0 По МассивДанных.Количество() - 1 Цикл
			Попытка
				СтрокаТаблицы[Индекс] = СокрЛП(МассивДанных[Индекс]);
			Исключение
				СтрокаОшибки = СтрШаблон("При загрузке строки(%1) произошла ошибка: %2", СтрокаДанных, ОписаниеОшибки());
				Сообщить(СтрокаОшибки);
			КонецПопытки
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДанных;
КонецФункции // ЗагрузитьДанныеВТаблицу()



Функция СоздатьТабличныйДокументПоТаблицеЗначений(ТаблицаЗначений) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	// Получаем колонки из ПЕРЕДАННОЙ таблицы
	Колонки = ТаблицаЗначений.Колонки;
	
	НомерСтроки = 1;
	НомерКолонки = 1;
	Для Каждого ТекущаяКолонка Из Колонки Цикл
		Ячейка = ТабДок.Область(НомерСтроки, НомерКолонки);
		Ячейка.Текст = ТекущаяКолонка.Имя;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	// Заполняем тело таблицы
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		НомерСтроки = ТабДок.ВысотаТаблицы + 1;
		Для НомерКолонки = 1 По Колонки.Количество() Цикл
			Ячейка = ТабДок.Область(НомерСтроки, НомерКолонки);
			Ячейка.Текст = СтрокаТаблицы[НомерКолонки - 1];
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции