		Функция ПолучитьИмяКаталога() Экспорт
			
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			
			ИмяКаталога = "";
			
			Если Диалог.Выбрать() Тогда
				ИмяКаталога = Диалог.Каталог;
			КонецЕсли;
			
			Возврат ИмяКаталога;
			
		КонецФункции // ПолучитьИмяКаталога() получаем в переменную имя каталог из поля по нажатию кнопки
		
		
		Функция ЗагрузитьДанныеИзФайлов(ИмяКаталога) Экспорт
			
			Текст = Новый ТекстовыйДокумент;
			
			СтрокаВнешнихДанных = "";
			
			МассивФайлов = НайтиФайлы(ИмяКаталога, "*.txt", Ложь);
			
			Для Каждого Файл Из МассивФайлов Цикл
				
				Текст.Прочитать(Файл.ПолноеИмя);
				СтрокаВнешнихДанных = СтрокаВнешнихДанных + Текст.ПолучитьТекст();
				
			КонецЦикла;
			
			Возврат СтрокаВнешнихДанных;
			
			ВнешниеДанные = СтрокаВнешнихДанных;
			
			
		КонецФункции // ЗагрузитьДанныеИзФайлов()