&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СтрокаВывода = "В кантерлоте сечйас - " + Формат(ТекущаяДата(), "ДФ=ЧЧ.мм.сс");
	Сообщить(СтрокаВывода);
КонецПроцедуры


Процедура НашОбработчик(НашЭлемент)
	
	Сообщить("Изменение товара - " +)
	
КонецПроцедуры



&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	МассивТоваров = СтрРазделить(СписокТоваров, ",", Ложь);
	КоличествоТоваров = МассивТоваров.Количество();
КонецПроцедуры

//Видео 19


&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	Сумма = ПосчитатьСумму(Цена, Количество);
КонецПроцедуры


&НаКлиенте
Функция ПосчитатьСумму(ЦенаРассчета, КоличествоРассчета)
	
	СуммаРассчета = ЦенаРассчета * КоличествоРассчета
		; Возврат СуммаРассчета;
	
КонецФункции

////Видео 19.2

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Вывод(Количество);
КонецПроцедуры

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	Вывод(Событие);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Вывод(Дата);
КонецПроцедуры



&НаКлиенте
Процедура Вывод(Ввод)
	Вывод = СтрШаблон("Ивменено поле с типом %1. Новое значение поля %2.", ТипЗнч(Ввод), Ввод);
	Сообщить(Вывод);
	
КонецПроцедуры


&НаКлиенте
Процедура Кнопка(Команда)
	message("Нажата кнопка");
	message(Событие + Символы.ПС + Количество + Символы.ПС + Дата);
КонецПроцедуры