&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СтрокаВывода = "В кантерлоте сечйас - " + Формат(ТекущаяДата(), "ДФ=ЧЧ.мм.сс");
	Сообщить(СтрокаВывода);
КонецПроцедуры


Процедура НашОбработчик(НашЭлемент)
	
	Сообщить("Изменение товара - " +)
	
КонецПроцедуры



&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	МассивТоваров = СтрРазделить(СписокТоваров, ",", Ложь);
	КоличествоТоваров = МассивТоваров.Количество();
КонецПроцедуры

//Видео 19


&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	Сумма = ПосчитатьСумму(Цена, Количество);
КонецПроцедуры


&НаКлиенте
Функция ПосчитатьСумму(ЦенаРассчета, КоличествоРассчета)
	
	СуммаРассчета = ЦенаРассчета * КоличествоРассчета
		; Возврат СуммаРассчета;
	
КонецФункции

////Видео 19.2

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Вывод(Количество);
КонецПроцедуры

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	Вывод(Событие);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Вывод(Дата);
КонецПроцедуры



&НаКлиенте
Процедура Вывод(Ввод)
	Вывод = СтрШаблон("Ивменено поле с типом %1. Новое значение поля %2.", ТипЗнч(Ввод), Ввод);
	Сообщить(Вывод);
	
КонецПроцедуры


&НаКлиенте
Процедура Кнопка(Команда)
	message("Нажата кнопка");
	message(Событие + Символы.ПС + Количество + Символы.ПС + Дата);
КонецПроцедуры


//Видео 20

&НаКлиенте
Процедура ИмяКаталогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если Диалог.Выбрать() Тогда
		ИмяКаталога = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВнешниеДанные(Команда)
	Текст = Новый ТекстовыйДокумент;
	СтрокаВнешнихДанных = "";
	МассивФайлов = НайтиФайлы(ИмяКаталога, "*.txt", Ложь);
	Для Каждого Файл Из МассивФайлов Цикл
		
		Текст.Прочитать(Файл.ПолноеИмя);
		СтрокаВнешнихДанных = СтрокаВнешнихДанных + Текст.ПолучитьТекст();
		
	КонецЦикла;
КонецПроцедуры

СтруктураКолонок = Новый Структура("Фамилия, Задача, Ставка, ЧислоЧасов")
	СтруктураКолонок.Ставка = Новый ОписаниеТипов("Число");
СтруктураКолонок.ЧислоЧасов = Новый ОписаниеТипов("Число");

//Видео 20

&НаКлиенте
Процедура ИмяКаталогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если Диалог.Выбрать() Тогда
		ИмяКаталога = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВнешниеДанные(Команда)
	Текст = Новый ТекстовыйДокумент;
	
	СтрокаВнешнихДанных = "";
	
	МассивФайлов = НайтиФайлы(ИмяКаталога, "*.txt", Ложь);
	
	Для Каждого Файл Из МассивФайлов Цикл
		
		Текст.Прочитать(Файл.ПолноеИмя);
		СтрокаВнешнихДанных = СтрокаВнешнихДанных + Текст.ПолучитьТекст();
		
	КонецЦикла;
	
	ВнешниеДанные = СтрокаВнешнихДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВТаблицу(Команда)
	
	ЗагрузитьДанныеВТаблицуНаСервере(ВнешниеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВТаблицуНаСервере(СтрокаВнешнихДанных)
	
	СтруктураКолонок = Новый Структура("Фамилия, Задача, Ставка, ЧислоЧасов");
	СтруктураКолонок.Ставка = Новый ОписаниеТипов("Число");
	СтруктураКолонок.ЧислоЧасов = Новый ОписаниеТипов("Число");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Колонки = ТаблицаДанных.Колонки;
	Для Каждого ОписаниеКолонки Из СтруктураКолонок Цикл
		
		Если ТипЗнч(ОписаниеКолонки.Значение) = Тип("ОписаниеТипов") Тогда
			
			Колонки.Добавить(ОписаниеКолонки.Ключ, ОписаниеКолонки.Значение);
			
		Иначе
			
			Колонки.Добавить(ОписаниеКолонки.Ключ);
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
	МассивСтрок = СтрРазделить(СтрокаВнешнихДанных, Символы.ПС);
	
	Для Каждого СтрокаДанных Из МассивСтрок Цикл
		
		МассивСтрок = СтрРазделить(СтрокаВнешнихДанных, Символы.ПС);
		
		Для Каждого СтрокаДанных Из МассивСтрок Цикл
			
			МассивДанных = СтрРазделить(СтрокаДанных, ", ", Ложь);
			СтрокаТаблицы = ТаблицаДанных.Добавить();
			
			Для Индекс = 0 По МассивДанных.Количество() - 1 Цикл
				СтрокаТаблицы[Индекс] = МассивДанных[Индекс];
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Сообщить(ТаблицаДанных.Итог("Ставка"));
	
	
	
КонецПроцедуры