&НаКлиенте
Процедура ИмяКаталогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяКаталога = _РаботаСФайлами.ПолучитьИмяКаталога()
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ЗагрузитьВнешниеДанные(Команда)
		ЭтотОбъект.ВнешниеДанные = _РаботаСФайлами.ЗагрузитьДанныеИзФайлов(ЭтотОбъект.ИмяКаталога);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВТаблицу(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	СтрокаВнешнихДанных = "";
	ЗагрузитьДанныеВТаблицуНаСервере(ТабДок, СтрокаВнешнихДанных);
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВТаблицуНаСервере(ТабДок, СтрокаВнешнихДанных)
	
	СтруктураКолонок = Новый Структура("Фамилия, Задача, Ставка, ЧислоЧасов");
	СтруктураКолонок.Ставка = Новый ОписаниеТипов("Число");
	СтруктураКолонок.ЧислоЧасов = Новый ОписаниеТипов("Число");
	
	ТаблицаДанных = _РаботаСТаблицей.ЗагрузитьДанныеВТаблицу(СтруктураКолонок, СтрокаВнешнихДанных);
	
	Сообщить(ТаблицаДанных.Итог("Ставка"));
	
	ТабДок = _РаботаСТаблицей.СоздатьТабличныйДокументПоТаблицеЗначений(ТаблицаДанных);
	
КонецПроцедуры