&НаСервере
Процедура НайтиТоварНаСервере()
	ЭлементПоиска = Справочники.Товары.НайтиПоНаименованию(НазваниеТовара);
	ОбъектПоиска = ЭлементПоиска.ПолучитьОбъект();
	ОбъектПоиска.Цена = ЭлементПоиска.Цена + 1;
	ОбъектПоиска.Записать();
	//Сообщить("Товар найден - " + (НЕ ЭлементПоиска.Пустая()));
КонецПроцедуры

&НаКлиенте
Процедура НайтиТовар(Команда)
	НайтиТоварНаСервере();
КонецПроцедуры

//Это внутри формы
&НаСервере
Процедура ЗавестиНоменклатуруНаСервере()
	Справочники.Товары.СоздатьТовар(НазваниеТовара, Производитель, Цена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавестиНоменклатуру(Команда)
	ЗавестиНоменклатуруНаСервере();
КонецПроцедуры