&НаСервере
Процедура НайтиТоварНаСервере()
	ЭлементПоиска = Справочники.Товары.НайтиПоНаименованию(НазваниеТовара);
	ОбъектПоиска = ЭлементПоиска.ПолучитьОбъект();
	ОбъектПоиска.Цена = ЭлементПоиска.Цена + 1;
	ОбъектПоиска.Записать();
	//Сообщить("Товар найден - " + (НЕ ЭлементПоиска.Пустая()));
КонецПроцедуры

&НаКлиенте
Процедура НайтиТовар(Команда)
	НайтиТоварНаСервере();
КонецПроцедуры
//--------------------------Создание Номенклатуры-----------------------------------
&НаСервере
Процедура ЗавестиНоменклатуруНаСервере()
	Справочники.Товары.СоздатьТовар(НазваниеТовара, Производитель, Цена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавестиНоменклатуру(Команда)
	ЗавестиНоменклатуруНаСервере();
КонецПроцедуры
//--------------------------Поиск Номенклатуры и заполнение------------------------

&НаСервере
Процедура НайтиНоменклатуруНаСервере()
	НайденнаяНоменклатура = Справочники.Товары.НайтиНоменклатуру(НазваниеТовара);
	Если НайденнаяНоменклатура <> Неопределено Тогда
		Цена = НайденнаяНоменклатура.Цена;
		Производитель = НайденнаяНоменклатура.Производитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	НайтиНоменклатуруНаСервере();
КонецПроцедуры